{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Привет",
        "Здравствуйте",
        "Добрый день",
        "Хай",
        "Приветствую"
      ],
      "responses": [
        "Привет!",
        "Здравствуйте!",
        "Рад видеть вас!"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Пока",
        "До свидания",
        "Увидимся",
        "Прощайте"
      ],
      "responses": [
        "До встречи!",
        "Пока!",
        "Всего доброго!"
      ]
    },
    {
      "tag": "psych_help",
      "patterns": [
        "Мне плохо",
        "Я чувствую тревогу",
        "У меня депрессия",
        "Я чувствую себя одиноким",
        "Я переживаю кризис",
        "Мне нужна помощь",
        "Как справиться с тревогой?",
        "Как улучшить настроение?",
        "Что делать, если мне плохо?",
        "Я не справляюсь с проблемами",
        "Мне тяжело"
      ],
      "responses": [
        "Мне жаль, что ты чувствуешь себя так. Помни, что помощь всегда рядом. Попробуй поговорить с кем-нибудь, кому доверяешь.",
        "Я понимаю, что тебе тяжело. Если чувства стали невыносимыми, обязательно обратись за профессиональной поддержкой.",
        "Когда все кажется слишком сложным, важно не оставаться наедине с проблемой. Возможно, стоит поговорить с психологом или близким человеком.",
        "Я не специалист, но знаю, что забота о себе очень важна. Попробуй найти время для отдыха, прогулок и занятий, которые приносят радость.",
        "Помни, что каждый человек иногда переживает трудные моменты. Обращение за помощью — это проявление силы, а не слабости.",
        "Если тебе кажется, что ситуация выходит из-под контроля, попробуй заняться релаксацией или дыхательными упражнениями. Если не помогает, обратись к специалисту.",
        "Я понимаю, что это сложно. Иногда полезно записывать свои мысли или поговорить с другом, чтобы разобраться в ситуациях.",
        "Знай, что ты не один. Есть люди и организации, готовые тебя поддержать. Постарайся не замыкаться в себе и откройся тому, кто может помочь.",
        "Иногда даже небольшой шаг — например, прогулка или прослушивание любимой музыки — может немного улучшить настроение. Попробуй найти, что приносит тебе утешение.",
        "Если негативные мысли становятся навязчивыми, попробуй выполнить технику глубокого дыхания или медитации. А если состояние ухудшается, обязательно обратись за профессиональной помощью.",
        "Пожалуйста, помни: забота о себе — это не эгоизм, а необходимость. Попробуй выделить время для расслабления и приятных занятий, даже если сейчас это кажется сложным.",
        "Если ты чувствуешь, что не справляешься, помни, что многие сталкиваются с подобными переживаниями. Обращение к специалисту может стать первым шагом к облегчению."
      ]
    }
  ]
}